# Pandas - Series

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\taina\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\taina\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\taina\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\taina\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\users\taina\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
from pandas import Series

In [2]:
import pandas as pd

In [3]:
pd.__version__

'0.25.1'

In [4]:
# criando series sem especificar os indices

obj = Series([1,2,3,4])

In [5]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
type(obj)

pandas.core.series.Series

In [7]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [8]:
# stop: começa em 0 e termina em 4, excluindo o 4.
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])

In [11]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
type(obj2)

pandas.core.series.Series

In [13]:
# neste caso a exibição do indice é diferente
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
obj2.values

array([1, 2, 3, 4], dtype=int64)

In [15]:
obj2[obj2>2]

c    3
d    4
dtype: int64

In [16]:
obj2['a']

1

In [17]:
obj[2]

3

In [18]:
'd' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
# Apenas para indices, valores nao funciona:
4 in obj2

False

In [22]:
dict = {'futebol': 1234, 'basquete': 1425, 'natação': 8787, 'voley': 8975}

In [23]:
#chave vira indicie e valor vira valor
obj3 = Series(dict)

In [24]:
obj3

futebol     1234
basquete    1425
natação     8787
voley       8975
dtype: int64

In [25]:
esporte = ['futebol', 'basquete', 'natação', 'tenis']

In [26]:
# foi criado o indice esporte e ele substituiu o meu indice do dict e colocou o 
obj4 = Series(dict, index = esporte)

In [27]:
#tenis nao exite no dict, por isso fica como valor missing NaN
obj4

futebol     1234.0
basquete    1425.0
natação     8787.0
tenis          NaN
dtype: float64

In [28]:
pd.isnull(obj4)

futebol     False
basquete    False
natação     False
tenis        True
dtype: bool

In [29]:
pd.notnull(obj4)

futebol      True
basquete     True
natação      True
tenis       False
dtype: bool

In [30]:
obj4.isnull()

futebol     False
basquete    False
natação     False
tenis        True
dtype: bool

In [32]:
obj3

futebol     1234
basquete    1425
natação     8787
voley       8975
dtype: int64

In [33]:
obj4

futebol     1234.0
basquete    1425.0
natação     8787.0
tenis          NaN
dtype: float64

In [34]:
#concatenação. apenas ocorre se houver ocorrencia dos indices em ambas as séries
obj3 + obj4

basquete     2850.0
futebol      2468.0
natação     17574.0
tenis           NaN
voley           NaN
dtype: float64

In [35]:
#nome do objeto
obj4.name = 'teste'

In [36]:
obj4

futebol     1234.0
basquete    1425.0
natação     8787.0
tenis          NaN
Name: teste, dtype: float64

In [37]:
obj4.index.name = 'nome index'

In [38]:
obj4

nome index
futebol     1234.0
basquete    1425.0
natação     8787.0
tenis          NaN
Name: teste, dtype: float64

In [39]:
# nome dos indices
obj4.index.name = 'esportes'

In [40]:
obj4

esportes
futebol     1234.0
basquete    1425.0
natação     8787.0
tenis          NaN
Name: teste, dtype: float64

# Dataframe

In [5]:
from pandas import DataFrame

In [6]:
data = {'Estado': ['MG', 'SP', 'RJ', 'GO', 'MA'],
       'Ano': [2002, 2003, 2004, 2005, 2006],
       'População': [1.5, 1.6, 1.7, 1.8, 1.9]}

In [43]:
frame = DataFrame(data)

In [44]:
frame

  Estado   Ano  População
0     MG  2002        1.5
1     SP  2003        1.6
2     RJ  2004        1.7
3     GO  2005        1.8
4     MA  2006        1.9

In [45]:
type(frame)

pandas.core.frame.DataFrame

In [46]:
#Definindo indices manualmente
DataFrame(data, columns = ['Ano', 'Estado', 'População'])

    Ano Estado  População
0  2002     MG        1.5
1  2003     SP        1.6
2  2004     RJ        1.7
3  2005     GO        1.8
4  2006     MA        1.9

In [7]:
frame2 = DataFrame(data, columns = ['Ano', 'Estado', 'População', 'Debito'],
                  index = ['um', 'dois', 'tres', 'quatro', 'cinco'])

In [8]:
frame2

         Ano Estado  População Debito
um      2002     MG        1.5    NaN
dois    2003     SP        1.6    NaN
tres    2004     RJ        1.7    NaN
quatro  2005     GO        1.8    NaN
cinco   2006     MA        1.9    NaN

In [50]:
frame3 = DataFrame(data, columns = ['Ano', 'Estado'],
                  index = ['um', 'dois', 'tres', 'quatro', 'cinco'])

In [51]:
frame3

         Ano Estado
um      2002     MG
dois    2003     SP
tres    2004     RJ
quatro  2005     GO
cinco   2006     MA

In [52]:
frame2['Estado']

um        MG
dois      SP
tres      RJ
quatro    GO
cinco     MA
Name: Estado, dtype: object

In [53]:
frame2.index

Index(['um', 'dois', 'tres', 'quatro', 'cinco'], dtype='object')

In [54]:
frame2.columns

Index(['Ano', 'Estado', 'População', 'Debito'], dtype='object')

In [55]:
frame2.values

array([[2002, 'MG', 1.5, nan],
       [2003, 'SP', 1.6, nan],
       [2004, 'RJ', 1.7, nan],
       [2005, 'GO', 1.8, nan],
       [2006, 'MA', 1.9, nan]], dtype=object)

In [56]:
type(frame2)

pandas.core.frame.DataFrame

In [57]:
# o ano é um atributo do dataframe
frame2.Ano

um        2002
dois      2003
tres      2004
quatro    2005
cinco     2006
Name: Ano, dtype: int64

In [58]:
# indexação ainda funciona mesmo quando mudamos o nome do indice. aqui ele irá pegar os do indice 0 e 1. 
# por isso ali no nome do indice aparece um e dois 
frame2[:2]

       Ano Estado  População Debito
um    2002     MG        1.5    NaN
dois  2003     SP        1.6    NaN

# Numpy e Pandas

In [1]:
import numpy as np

In [2]:
array = np.arange(5.)
array

array([0., 1., 2., 3., 4.])

In [9]:
frame2['Debito'] = array

In [10]:
frame2

         Ano Estado  População  Debito
um      2002     MG        1.5     0.0
dois    2003     SP        1.6     1.0
tres    2004     RJ        1.7     2.0
quatro  2005     GO        1.8     3.0
cinco   2006     MA        1.9     4.0

In [11]:
frame2.values

array([[2002, 'MG', 1.5, 0.0],
       [2003, 'SP', 1.6, 1.0],
       [2004, 'RJ', 1.7, 2.0],
       [2005, 'GO', 1.8, 3.0],
       [2006, 'MA', 1.9, 4.0]], dtype=object)

In [14]:
# algumas informações metricas sobre o frame
# count - numero de registros
# mean media
# std desvio padrão
# valor minimo, valor maximo
# percentil 
frame2.describe()

               Ano  População    Debito
count     5.000000   5.000000  5.000000
mean   2004.000000   1.700000  2.000000
std       1.581139   0.158114  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.600000  1.000000
50%    2004.000000   1.700000  2.000000
75%    2005.000000   1.800000  3.000000
max    2006.000000   1.900000  4.000000

In [15]:
# slice 
#vai imprimir os indices de dois a quatro
frame2['dois':'quatro']

         Ano Estado  População  Debito
dois    2003     SP        1.6     1.0
tres    2004     RJ        1.7     2.0
quatro  2005     GO        1.8     3.0

In [17]:
# algum valor menor que 5 ?
frame2['Debito'] < 5

um        True
dois      True
tres      True
quatro    True
cinco     True
Name: Debito, dtype: bool

In [20]:
frame2['Ano'] < 2004

um         True
dois       True
tres      False
quatro    False
cinco     False
Name: Ano, dtype: bool

# Localizando registros dentro do dataframe

In [21]:
# pega todas as informações que vem do indice 4
frame2.loc['quatro']

Ano          2005
Estado         GO
População     1.8
Debito          3
Name: quatro, dtype: object

In [22]:
# busca as informaçoes pelo indice - aqui considera a indexação do python
frame2.iloc[2]

Ano          2004
Estado         RJ
População     1.7
Debito          2
Name: tres, dtype: object

In [23]:
frame2.loc['dois']

Ano          2003
Estado         SP
População     1.6
Debito          1
Name: dois, dtype: object

# Invertendo coluna em indice

In [24]:
web = {'Dias': [1, 2, 3, 4, 5, 6, 7],
      'Visitantes': [45, 23, 15, 47, 55, 60, 90],
      'Taxa': [11, 22, 33, 44, 55, 66, 77]}

In [25]:
df = DataFrame(web)
df

   Dias  Visitantes  Taxa
0     1          45    11
1     2          23    22
2     3          15    33
3     4          47    44
4     5          55    55
5     6          60    66
6     7          90    77

In [29]:
# Coloca a coluna na coluna de indice do dataframe, usando set_indice
df.set_index('Dias')

      Visitantes  Taxa
Dias
1             45    11
2             23    22
3             15    33
4             47    44
5             55    55
6             60    66
7             90    77

In [31]:
df.iloc[0]

Dias           1
Visitantes    45
Taxa          11
Name: 0, dtype: int64

In [32]:
df.iloc[1]

Dias           2
Visitantes    23
Taxa          22
Name: 1, dtype: int64

In [38]:
# mostra as primeiras linhas do dataframe
df.head()

   Dias  Visitantes  Taxa
0     1          45    11
1     2          23    22
2     3          15    33
3     4          47    44
4     5          55    55

In [39]:
df['Visitantes']

0    45
1    23
2    15
3    47
4    55
5    60
6    90
Name: Visitantes, dtype: int64

In [43]:
df[['Visitantes','Taxa']]

   Visitantes  Taxa
0          45    11
1          23    22
2          15    33
3          47    44
4          55    55
5          60    66
6          90    77